kaminari-walkthrough/app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts" LIMIT ? OFFSET ?  [["LIMIT", 25], ["OFFSET", 0]]
SELECT COUNT(*) FROM "posts"
---
  def index
    @posts = Post.all.page params[:page]